# CLI tools
brew "container"
brew "coreutils"
brew "fastfetch"
brew "gnu-sed"
brew "gnupg"
brew "hey"
brew "librsvg"
brew "mas"
brew "mise"
brew "pkg-config"
brew "poppler" # PDF utilities (pdftoppm/pdfinfo) used by Claude Code to read PDFs
brew "telnet"
brew "transcrypt"
cask "codex"

# Shell plugins (required by .zshrc)
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"

# Terminal
brew "tmux"
tap "manaflow-ai/cmux"
cask "cmux"
cask "ghostty"

# Browser
cask "arc"
cask "thebrowsercompany-dia"

# Editor
cask "zed@preview"

# Notes
cask "obsidian"
cask "typora"

# Communication
cask "discord"
cask "slack"
cask "zoom"

# AI
cask "chatgpt"
cask "claude"

# Development
cask "coderabbit"
cask "devpod"
cask "drawio"
cask "linear"
cask "orbstack"
cask "wakatime"
# Xcode: App Store auto-updates, large download blocks brew bundle
# mas "Xcode", id: 497799835

# Launcher
cask "raycast"

# Security
cask "1password"
cask "1password-cli"

# Utilities
cask "duet"
mas "RunCat Neo", id: 6757801838 # Menu bar CPU indicator, Mac App Store only (no cask)
cask "the-unarchiver"

# IME
cask "azookey"

# Fonts
cask "font-maple-mono-nf"
