# CLI tools
brew "coreutils"
brew "fastfetch"
brew "gnu-sed"
brew "gnupg"
brew "mise"
brew "telnet"
cask "codex"

# Shell plugins (required by .zshrc)
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"

# Terminal
cask "ghostty"

# Browser
cask "arc"
cask "thebrowsercompany-dia"

# Editor
cask "zed@preview"

# Notes
cask "obsidian"
cask "typora"

# Communication
cask "discord"
cask "slack"
cask "zoom"

# AI
cask "claude"

# Development
cask "coderabbit"
cask "orbstack"
cask "wakatime"

# Launcher
cask "raycast"

# Security
cask "1password"
cask "1password-cli"

# Utilities
cask "the-unarchiver"

# IME
cask "azookey"

# Fonts
cask "font-maple-mono-nf"
